/**
 * +----------------------------------------------------------------------
 * | mock数据
 * +----------------------------------------------------------------------
 * | Author: 470211273@qq.com
 * +----------------------------------------------------------------------
 */
/**
 * mock学生列表信息
 */
var name_list = ["赵婧文","赵竹林","钱奕宣","陈品如","张峰铭","秦桧","陶崎昀","魏享","喻晋文","陈品希","张招英","陈禹西","尤岳阳","陈亮伟","王五","钱若溪","赵山川","钱亚男","汤博名","费萌萌","费书生","汤君明","安帅豪","袁箕驿","安子豪","卞玉栋","赵威皓","赵威皓","赵威皓","卞萱","张建科","赵威皓","袁霖","陶冶","张智娟","秦骞翼","袁航","秦镜高","陶崎昀","魏魏","喻葵","魏魏","喻瑾静"]
var gender_list = ["男", "女"]

var stuList = []
var count = 10

for (let i = 0; i < count; i++) {
    stuList.push({
        'name|1': name_list, // "name|1"代表从对应数组中随机选一个
        'age|20-30': 25, // "age|20-30"代表在20-30之间随机生成一个整数
        'gender|1': gender_list // "gender|1"代表从对应数组中随机选一个
    })
}

mockJson = {
    "error_code": "0",
    "error_msg": "请求成功",
    "data": {
        "page": {
            "total": 50,
            "page_total": 5,
            "page_current": 1,
            "page_size": 20
        },
        "list": stuList
    }
}

Mock.mock('http://zwl.com/stu_list', mockJson)

/**
 * mock学生详情
 */
Mock.mock('http://zwl.com/stu_detail',{
    'name|1':name_list,
    'age|20-30':25,
    'gender|1': gender_list
})
